## Homework 2 Submission
Write your name and surname below:
<br>
Name: Arpi
<br>
Surname: Hunanyan

***Problem 1:***<br>a. Write a lambda function that raises a number to the third power and maps it on the following list creating a new list named "result".<br>
b.  Define a function that takes a number as an input and returns True if it is odd and False otherwise. Filter "result" list keeping only odd numbers using the function defined.

In [50]:
#a 
nums = [3, 4, 5, 6, 7]

###_____________Start code here_________________###
f=lambda lis : [i**3 for i in lis ]
result=f(nums)
print(result)
###_____________End code here_________________###

[27, 64, 125, 216, 343]

In [52]:
#b
###_____________Start code here_________________###

def f1(num):
    if num%2!=0:
        return True
    else:
        return False
filt_result=list(filter(f1,result))
print(filt_result)

###_____________End code here_________________###

[27, 125, 343]

***Problem 2:*** <br>Write a program that asks a user to provide  a name  and a surname and returns a new email with  "@edu.aua.am" ending and underscore between the name and surname.<br> **Example**:
For a person named Steve Jobs the email should be steve_jobs@edu.aua.am.

In [53]:
###_____________Start code here_________________###

name =input("your name ")
surname=input("your surname ")
print("{0}{1}{2}{3}".format(name.lower(),"_",surname.lower(),"@edu.aua.am"))

###_____________End code here_________________###

your name Steve
your surname Jobs
steve_jobs@edu.aua.am

***Problem 3:*** <br> a. Use an assert statement to make sure that the passed list is not empty and if it is empty report it with an expression that tells the list being empty <br>b. Write a function that asks a user to input numbers separated by a comma and return the average of numbers.<br> Make sure to warn the user if he/she provided as an input anything other than number.<br>
**Hint:** You can use try/except.

In [60]:
#a
def avg(marks):
    
    ###_____________Start code here_________________###
    assert(marks),"the list is empty "
    
    ###_____________End code here_________________###

    return sum(marks)/len(marks)

mark1 = [1,2,3]
print("Average of mark1:",avg(mark1))

Average of mark1: 2.0

In [61]:
#b
###_____________Start code here_________________###
def func():
    num= input("Write numbers separated by a comma I am warning you only numbers   ")
    try:
        num_fin=eval(num)
        ret=sum(num_fin)/len(num_fin)
    except:
        print("You did not  get what I have told you")
    else:
        print("the average of numbers:",ret)
func()




###_____________End code here_________________###

Write numbers separated by a comma I am warning you only numbers   1,2,3
the average of numbers: 2.0

***Problem 4:***  <br>Given the list below, create a new one that contains all the numeric elements of the nested lists using list comprehensions.<br>
**Note:** "10" is numeric. <br>
**Hint:** Use isdigit() method to check whether a string is numeric.

In [62]:
list_of_list = [[1,"I am a string",2,3],[4,"5",6,"Not a number"],[7,8,9,"10"]]
###_____________Start code here_________________###

newLis=[i for j in list_of_list for i in j if str(i).isdigit() ]
print(newLis)

###_____________End code here_________________###

[1, 2, 3, 4, '5', 6, 7, 8, 9, '10']

***Problem 5:***<br>Increase the following data scientists' salaries by 10 percent except for Lord Voldemort using dictionary comprehension.

In [63]:
Data_Scientist={"Harry Potter":700,"Ron Weasley":650,"Lord Voldemort":900,"Hermione Granger":800,"Albus Dumbledore":1000}

#???????????????
###_____________Start code here_________________###

Data_Scientist={"Harry Potter":700,"Ron Weasley":650,"Lord Voldemort":900,"Hermione Granger":800,"Albus Dumbledore":1000}
new_Data_Scientist={k:int(Data_Scientist[k]*1.1 ) if k !="Lord Voldemort"  else Data_Scientist[k] for k in  Data_Scientist for k in  Data_Scientist}
print(new_Data_Scientist)


###_____________End code here_________________###

{'Harry Potter': 770, 'Ron Weasley': 715, 'Lord Voldemort': 900, 'Hermione Granger': 880, 'Albus Dumbledore': 1100}

***Problem 6:***<br>a. Create a new folder in your current directory named "files" and change directory into that folder.<br>
b. There are 4 famous quotes in "quotes" list provided below. Create/write 4 separate txt files one for each quote.<br>
c. List all the files in "files" directory and loop over the files to read the quotes and write all quotes in a new txt file called "combined.txt".
<br>**Note: Do not forget to change back to your working directory for the remaining problems.**

In [407]:
#a
###_____________Start code here_________________###
import os
#os.mkdir("files")
print(os.getcwd())
os.chdir("/Users/apple/Desktop/DS/hw2/files")
print(os.getcwd())

###_____________End code here_________________###

/Users/apple/Desktop/DS/hw2/files
/Users/apple/Desktop/DS/hw2/files

In [131]:
#b
quotes=["I'm going to make him an offer he can't refuse.",
"The first rule of Fight Club is: You do not talk about Fight Club.",
"Of all the gin joints in all the towns in all the world, she walks into mine.", 
"Being brave doesn't mean you go looking for trouble․"]

###_____________Start code here_________________###
q_1=open("quote1.txt","w")
q_1.write(quotes[0])
q_1.close()

q_2=open("quote2.txt","w")
q_2.write(quotes[1])
q_2.close()

q_3=open("quote3.txt","w")
q_3.write(quotes[2])
q_3.close()

q_4=open("quote4.txt","w")
q_4.write(quotes[3])
q_4.close()
###_____________End code here_________________###

In [410]:
os.listdir()
os.removedirs('.ipynb_checkpoints')

In [445]:
os.listdir()

['combined.txt', 'quote3.txt', 'quote2.txt', 'quote1.txt', 'quote4.txt']

In [453]:
#chkanches
l=os.listdir()
s=""
qou=open("combined.txt","w")
for i in l:
    with open(i,"r") as qout:
        s=qout.read()+"\n"+s
print(s)    
qou.write(s) 
qou.close()

Being brave doesn't mean you go looking for trouble․
I'm going to make him an offer he can't refuse.
The first rule of Fight Club is: You do not talk about Fight Club.
Of all the gin joints in all the towns in all the world, she walks into mine.

In [455]:
os.chdir("/Users/apple/Desktop/DS/hw2")

***Problem 7:***
<br>a. Calculate the value of "string" expression given below.<br>
b. Execute the code written in "code.txt" file attached.

In [16]:
#a
a=5
c=2
string='round((a+51)**c/75,-1)+1'

###_____________Start code here_________________###

eval(string)
###_____________End code here_________________###

41.0

In [11]:
#b

###_____________Start code here_________________###
code=open("code.txt","r")
code_fin=code.read()
exec(code_fin)

code.close()

###_____________End code here_________________###

x is 2,y is 4 and z is 3
x**y+z is 19
Hello, I am your code

***Problem 8:***<br>
**a.**<br> Our 5 students' test scores are now stored in the 2-d array "student_scores". Each row stores the corresponding test's scores. <br>
Calculate the mean of grades of each student(columns) and the median of grades per test (rows)?

In [138]:


###_____________Start code here_________________###
import numpy as np
student_scores = np.array([[92, 94, 88, 91, 87],
                           [79, 100, 86, 93, 91],
                           [87, 85, 72, 90, 92]])
 

for i in range(len(student_scores[0,:])):
    print("the mean of grades of {} student".format(i+1),np.mean(student_scores[:,i]),"\n")
for i in range(len(student_scores[:,0])):
    print("the median of grades {} test  ".format(i+1),np.mean(student_scores[i,:]),"\n")

###_____________End code here_________________###

the mean of grades of 1 student 86.0

the mean of grades of 2 student 93.0

the mean of grades of 3 student 82.0

the mean of grades of 4 student 91.33333333333333

the mean of grades of 5 student 90.0

the median of grades 1 test   90.4

the median of grades 2 test   89.8

the median of grades 3 test   85.2

**b.**<br>
Create a logical statement that selects elements in "porridge" array that are less than 60, and saves them in a new array called "cold".<br>
Create a logical statement that finds all elements that are higher than 80 and saves them in an array named "hot".

In [32]:
porridge = np.array([79, 65, 50, 63, 56, 90, 85, 98, 79, 51])
###_____________Start code here_________________###

cold= porridge[porridge<60]
print(cold)
hot= porridge[porridge>80]
print(hot)
###_____________End code here_________________###

[50 56 51]
[90 85 98]

***Problem 9:***<br><br>**Note:** You do not have to create arrays mannualy; you can use NumPy methods for the below assignments.
<br>**a.** Create a null vector of length 100 then assign 10 to 5th value.<br>  
**b.** Create a vector of length 10 with random integers between 1 and 10.<br>
**c.** Convert the given 1D array to a 2D array with 5 rows and 2 columns.
<br> **Hint:** You can use numpy's reshape, random.randint, random.random methods for the below assignments.

In [43]:
#a
###_____________Start code here_________________###
null_vector=np.zeros(100)
null_vector[4]=10
print(null_vector)



###_____________End code here_________________###

[ 0.  0.  0.  0. 10.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.
  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.
  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.
  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.
  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.
  0.  0.  0.  0.  0.  0.  0.  0.  0.  0.]

In [45]:
#b hanel
###_____________Start code here_________________###
vec =np.random.randint(1,10,size=10)
print(vec)

###_____________End code here_________________###

[1 3 8 3 2 4 6 4 8 7]

In [49]:
#c
arr=np.array([ 0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
###_____________Start code here_________________###

arr1=arr.reshape(5,2)
print(arr1)
###_____________End code here_________________###

[[0 1]
 [2 3]
 [4 5]
 [6 7]
 [8 9]]

***Problem 10:***<br>
Create a DataFrame with the provided data. We have already filled in the information for "Product ID" in "df1".<br>
Write a code to create the columns "Product Name" and "Color" with the data given below.</center><br>
Products are a pair of blue jeans, a green t-shirt, a black hat and white shoes.<br>
After all output (save) it as an .xlsx file in your current directory.

In [1]:
import pandas as pd


    ###_____________Start code here_________________###
df1 =pd.DataFrame({'Product ID': [1, 2, 3, 4]})
df1["Product Name"] =["jeans","t-shirt","hat","shoes"]
df1["Color"] =["blue","green ","black","white"] 

df1.to_excel("df1.xlsx")   
 

    ###_____________End code here_________________###

***Problem 11:***<br>Read the attached file "titanic.csv" as DataFrame "df", have a look at first 5 rows and get information about the dataset using info() method.</strong><br>

In [2]:
###_____________Start code here_________________###
tit=pd.read_csv("titanic.csv")
print(tit.info())
tit.head()
###_____________End code here_________________###

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
pclass       1309 non-null int64
survived     1309 non-null int64
name         1309 non-null object
sex          1309 non-null object
age          1046 non-null float64
sibsp        1309 non-null int64
parch        1309 non-null int64
ticket       1309 non-null object
fare         1308 non-null float64
cabin        295 non-null object
embarked     1307 non-null object
boat         486 non-null object
body         121 non-null float64
home.dest    745 non-null object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.2+ KB
None

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

Here is the description of dataset columns:
survival - Survival (0 = No; 1 = Yes)<br>
class - Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)<br>
sex - Sex<br>
age - Age<br>
sibsp - Number of Siblings/Spouses Aboard<br>
parch - Number of Parents/Children Aboard<br>
ticket - Ticket Numbe
fare - Passenger Fare<br>
cabin - Cabin<br>
embarked - Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)<br>
boat - Lifeboat (if survived)<br>
body - Body number (if did not survive and body was recovered)<br>
home.dest - Adress of people
<br><br>
a. Drop columns cabin, embarked, boat, body, home.dest.

In [3]:
#a
###_____________Start code here_________________###


tit=tit.drop(["cabin"],axis=1)
tit=tit.drop(["embarked"],axis=1)
tit=tit.drop(["boat"],axis=1)
tit=tit.drop(["body"],axis=1)
tit=tit.drop(["home.dest"],axis=1)



###_____________End code here_________________###

In [4]:
tit.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500

b. Check how many rows contain missing values.

In [5]:
#b
###_____________Start code here_________________###

tit.isna().any()

###_____________End code here_________________###

pclass      False
survived    False
name        False
sex         False
age          True
sibsp       False
parch       False
ticket      False
fare         True
dtype: bool

c. Fill missing values in age column by its mean or median.

In [6]:
#c
###_____________Start code here_________________###
mean=tit["age"].mean()



print(mean)
###_____________End code here_________________###

29.881137667304014

In [7]:
tit["age"].fillna(mean,inplace=True)

In [8]:
tit.isna().any()

pclass      False
survived    False
name        False
sex         False
age         False
sibsp       False
parch       False
ticket      False
fare         True
dtype: bool

d. Drop remaining missing values.

In [41]:
#d
###_____________Start code here_________________###
print(tit.isna().any())
i=tit[tit["fare"].isna()].index
tit.drop(tit.index[i], inplace=True)

###_____________End code here_________________###

pclass      False
survived    False
name        False
sex         False
age         False
sibsp       False
parch       False
ticket      False
fare        False
dtype: bool

Empty DataFrame
Columns: [pclass, survived, name, sex, age, sibsp, parch, ticket, fare]
Index: []

e. Calculate the percent of survived and not survived by sex.

In [45]:
#e
###_____________Start code here_________________###

f=tit[tit["sex"]=="female"]
f_p=f["survived"].sum()/len(f)*100
m=tit[tit["sex"]=="male"]
m_p=f["survived"].sum()/len(m)*100
print("the percent of survived female:     ",str(f_p)+"%")
print("the percent of not survived female: ",str(100-f_p)+"%")
print("the percent of survived male:       ",str(m_p)+"%")
print("the percent of not survived male:   ",str(100-m_p)+"%")
###_____________End code here_________________###

the percent of survived female:      72.74678111587983%
the percent of not survived female:  27.253218884120173%
the percent of survived male:        40.26128266033254%
the percent of not survived male:    59.73871733966746%

f. Create a new column named "fare_AMD" with the prices of tickets in AMD (1 USD = 485 AMD).<br>
**Hint:** You can do it by applying a function on column "fare".

In [46]:
#f
###_____________Start code here_________________###

tit["fare_AMD"]=tit[ "fare"].apply(lambda num : num *485)
tit.head()


###_____________End code here_________________###

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,fare_AMD
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,102498.6875
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,73501.7500
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,73501.7500
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,73501.7500
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,73501.7500

g. Round the values of "fare" column and add '$' sign in front of them by applying a lambda function.

In [54]:
#g
###_____________Start code here_________________###
tit["fare"]=tit["fare"].apply(lambda num: str(round(num))+"$")


tit.head()
###_____________End code here_________________###

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,fare_AMD
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211$,102498.6875
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,152$,73501.7500
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,152$,73501.7500
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,152$,73501.7500
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,152$,73501.7500

**Problem 13:**<br>
a. Find all names and ages in the text given below using regex and create dictionary where names are keys and ages are values.

In [264]:
text = "I'm Jonh and I'm 12 year old, Jack is 23 and Suzan is 45 and 2132 they all earning $100"

###_____________Start code here_________________###

import re 
names=re.findall("([A-Z]\w+)",text)
ages=re.findall("\d{2,2}",text)
nam_age=dict(zip(names,ages))
print(nam_age)



###_____________End code here_________________###

{'Jonh': '12', 'Jack': '23', 'Suzan': '45'}

b. Substitute all email endings in the text given below with "@hogwarts.com" using regex.

In [10]:
my_t = "My name is Harry, my e-mail is HarryPotter@aua.am, I need to send my statement of purpose to careers@aua.am"

###_____________Start code here_________________###
n_text=re.sub("@\w+.\w+","@hogwarts.com",my_t)
print(n_text)

###_____________End code here_________________###

My name is Harry, my e-mail is HarryPotter@hogwarts.com, I need to send my statement of purpose to careers@hogwarts.com

**Problem 14**
<br>Read "data.txt" file attached and get all phone numbers and email addresses into separate lists using regex.

In [266]:
###_____________Start code here_________________###
import re
with open( r"data.txt","r") as data:
    txt=data.read()
    
    numbers=re.findall("\d+-\d+-\d+",txt)
    email=re.findall("\w+@\w+.\w+",txt)
    print("all phone numbers: ",numbers,"\n")
    print("all email addresses: ",email)



###_____________End code here_________________###

all phone numbers:  ['800-555-5669', '560-555-5153', '900-555-9340', '714-555-7405', '800-555-6771', '783-555-4799', '516-555-4615', '127-555-1867', '608-555-4938', '568-555-6051', '292-555-1875']

all email addresses:  ['charlesharris@bogusemail.com', 'laurawilliams@bogusemail.com', 'coreyjefferson@bogusemail.com', 'jenniferwhite@bogusemail.com', 'tomdavis@bogusemail.com', 'neilpatterson@bogusemail.com', 'laurajefferson@bogusemail.com', 'mariajohnson@bogusemail.com', 'michaelarnold@bogusemail.com', 'michaelsmith@bogusemail.com', 'robertstuart@bogusemail.com']

***Problem 15***<br>Create a class of a human that has data attribute "nationality" as Armenian.<br> Make sure that the class instances of human class have arguments name, surname, profession and salary. <br>The class defined must have a method that returns an expression in this format: "Hi, I am "name" "surname". I am a/an "profession" and I earn "salary" a month."<br>
Create one or more isntancses of the class and call the class method defined on it or them.

In [16]:
###_____________Start code here_________________###

class Human:
    nationality="Armenian"
    def __init__(self,name, surname, profession,salary):
        self.name=name
        self.surname=surname
        self.profession=profession
        self.salary=salary
    def expres(self):
        return("Hi, I am {0} {1}. I am a/an {2} and I earn {3} a month.".format(self.name,self.surname,self.profession,self.salary))
human1=Human("Joe","Poghosyan","doctor","$1000")
print(human1.expres())
print(human1.nationality)

human2=Human("Ann","Kirakosyan","actress","$550")
print(human2.expres())
print(human2.nationality)
        
###_____________End code here_________________###

Hi, I am Joe Poghosyan. I am a/an doctor and I earn $1000 a month.
Armenian
Hi, I am Ann Kirakosyan. I am a/an actress and I earn $550 a month.
Armenian